Tekla Open API Reference for Tekla Structures 2025
ProfileItemSubType.BitmapName Property
 Gets a value of the property BitmapName.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string BitmapName { get; }
Public ReadOnly Property BitmapName As String
	Get
Property Value
Type: String
See Also
Reference
ProfileItemSubType Class
Tekla.Structures.Catalogs Namespace